type ZoneKey =
  | "Зона 1 (ФЫВАОЛДЖ)"
  | "Зона 2 (ПР)"
  | "Зона 3 (КЕНГ)"
  | "Зона 4 (МИТЬ)"
  | "Зона 5 (УСШБ)"
  | "Зона 6 (ЦЧЩЮ)"
  | "Зона 7 (ЁЙЯЗХЪЭ.,)"
  | "Зона 8 (1234567890)"
  | "Зона 9 (символы)"
  | "Зона Пробела";

export const ZoneToNameZone: Record<ZoneKey, string> = {
  "Зона 1 (ФЫВАОЛДЖ)": "фываолдж",
  "Зона 2 (ПР)": "пр",
  "Зона 3 (КЕНГ)": "кенг",
  "Зона 4 (МИТЬ)": "мить",
  "Зона 5 (УСШБ)": "усшб",
  "Зона 6 (ЦЧЩЮ)": "цчщю",
  "Зона 7 (ЁЙЯЗХЪЭ.,)": "ёйязхъэ.,",
  "Зона 8 (1234567890)": "1234567890",
  "Зона 9 (символы)": '!"№;%:?*()_-+=',
  "Зона Пробела": " ",
};
